/**
 * সমস্যা ১২: এক ওভারে মোট রান গণনা করুন
 * প্রস্তাবিত ফাংশনের নাম: sumOverRuns()
 *
 * সমস্যা: একজন ক্রিকেটার এক ওভারে কিছু রান করেছেন। ৬টি বলের প্রত্যেকটির রান একটি অ্যারেতে দেওয়া আছে। ওই ওভারে মোট রান গণনা করার জন্য একটি ফাংশন লিখুন।
 * চ্যালেঞ্জ: যদি অ্যারের কোনো উপাদান সংখ্যা না হয়, তবে যোগফলে এটিকে উপেক্ষা করা উচিত।
 *
 * নমুনা ইনপুট         -> নমুনা আউটপুট
 * [1, 6, 4, 0, 2, 4]   -> 17
 * [4, 'wide', 1, 6]    -> 11
 * [0, 0, 'no ball', 1] -> 1
 * []                   -> 0
 */

function sumOverRuns(runs) {
  let sum = 0;
  for (let i = 0; i < runs.length; i++) {
    if (typeof runs[i] === "number") {
      sum += runs[i];
    }
  }
  return sum;
}
const overRuns = [1, 6, 4, 0, 2, 4];
const result = sumOverRuns(overRuns);
console.log(result);
